app/controllers/articles_controller.rb

SELECT * FROM `articles` WHERE (`articles`.`id` = 1)
SELECT * FROM `articles`
---
  def show
    @article = Article.find(params[:id])
    @articles = Article.all

INSERT INTO `articles` (`photo`, `created_at`, `title`, `body`, `updated_at`, `sticky`) VALUES('', '2010-05-13 03:43:11', 'Investing in Palm Springs', 'CASH FLOW POSITIVE properties are available today! The credit boom and bust has created opportunities for investors that haven’t been possible in years.\r\n\r\nOur local knowledge and experience in the Palm Springs area rental market make us the perfect partner to help you build or add to your property investment portfolio.\r\n\r\nWhether you are looking for long term holds or flipping foreclosures, we know where the deals are. Our agents are active in the market every day. We are in contact constantly with agents and attorneys, search newly listed properties, watch Notice of Default filings, and subscribe to RealtyTrac and Foreclosure.com for the latest foreclosure information.\r\n\r\nOver 300 owners trust our rental division, The Rental Connection, with their property. This experience and up to the minute understanding of rental rates and vacancies give us an insight that traditional salespeople do not have. We are only interested in helping you buy a property that we KNOW is rentable. Knowing little things like evening wind direction, airport noise, and HOA stability help you make an informed investment decision.', '2010-05-13 03:43:11', 0)
---
  def create
    @article = Article.new(params[:article])

    respond_to do |format|
      if @article.save

SELECT * FROM `articles` WHERE (`articles`.`id` = 1)
UPDATE `articles` SET `updated_at` = '2010-05-13 03:56:53', `title` = 'Why buy in Palm Springs? Why buy today?' WHERE `id` = 2
---
  def update
    @article = Article.find(params[:id])

    respond_to do |format|
      if @article.update_attributes(params[:article])