app/controllers/resources_controller.rb

  def index
    @resources = Resource.all
---
SELECT * FROM `resources`

  def show
    @resource = Resource.find(params[:id])
    @resources = Resource.all
---
SELECT * FROM `resources` WHERE (`resources`.`id` = 1)
SELECT * FROM `resources`

  def edit
    @resource = Resource.find(params[:id])
---
SELECT * FROM `resources` WHERE (`resources`.`id` = 2)

  def create
    @resource = Resource.new(params[:resource])

    respond_to do |format|
      if @resource.save
---
INSERT INTO `resources` (`comment`, `topicid`, `created_at`, `title`, `updated_at`, `link`) VALUES('This is a website that is mostly about shoes.', NULL, '2010-05-13 18:00:10', 'Nike', '2010-05-13 18:00:10', 'www.nike.com')

  def update
    @resource = Resource.find(params[:id])

    respond_to do |format|
      if @resource.update_attributes(params[:resource])
---
SELECT * FROM `resources` WHERE (`resources`.`id` = 2)
UPDATE `resources` SET `updated_at` = '2010-05-14 01:34:31', `comment` = 'are they even in business anymore?' WHERE `id` = 4

  def destroy
    @resource = Resource.find(params[:id])
    @resource.destroy
---
SELECT * FROM `resources` WHERE (`resources`.`id` = 2)
DELETE FROM `resources` WHERE `id` = 2