app/controllers/searches_controller.rb

  def show
    @search = Search.find(params[:id])
---
SELECT * FROM `searches` WHERE (`searches`.`id` = 1)

  def edit
    @search = Search.find(params[:id])
---
SELECT * FROM `searches` WHERE (`searches`.`id` = 3)

  def create
    @search = Search.new(params[:search])

    respond_to do |format|
      if @search.save
---
INSERT INTO `searches` (`comment`, `created_at`, `title`, `updated_at`, `order`, `search`) VALUES('Here you can find all the properties Steve is currently listing.', '2010-05-18 18:39:15', 'Steve\'s Listings', '2010-05-18 18:39:15', 1, 'http://desertareamls.rapmls.com/scripts/mgrqispi.dll?APPNAME=Desertarea&PRGNAME=MLSLogin&ARGUMENT=A6NyxhjmUYSppCGgcP2%2FdAW4BEIXMxmUFH%2B%2FpixHRBw%3D&KeyRid=1')

  def update
    @search = Search.find(params[:id])

    respond_to do |format|
      if @search.update_attributes(params[:search])
---
SELECT * FROM `searches` WHERE (`searches`.`id` = 3)
UPDATE `searches` SET `updated_at` = '2010-05-18 18:52:55', `search` = 'desertareamls.rapmls.com/scripts/mgrqispi.dll?APPNAME=Desertarea&PRGNAME=MLSLogin&ARGUMENT=A6NyxhjmUYSppCGgcP2%2FdAW4BEIXMxmUFH%2B%2FpixHRBw%3D&KeyRid=1' WHERE `id` = 3

  def destroy
    @search = Search.find(params[:id])
    @search.destroy
---
SELECT * FROM `searches` WHERE (`searches`.`id` = 1)
DELETE FROM `searches` WHERE `id` = 1